# Отримуємо символ від користувача
symbol = input("Введіть символ, який ви хочете знайти у тексті: ")

# Відкриваємо файл для зчитування
with open("part_2.txt", "r") as file:
    # Зчитуємо текстовий рядок з файлу
    text = file.read()

    # Ініціалізуємо лічильник символів
    count = 0

    # Починаємо пошук символу
    index = 0
    while index < len(text):
        # Якщо символ співпадає з введеним користувачем, збільшуємо лічильник
        if text[index] == symbol:
            count += 1
        index += 1

# Виводимо результат
print(f"Символ '{symbol}' зустрічається у тексті {count} разів.")